public class Main {
    public static void main(String[] args) {
        System.out.println("Hello!");

        int price = 1200;
        int min = 20;
        int bonus = price / min;
        System.out.println(bonus + " -  Ваши бонусные мили за купленный билет");

        System.out.println("Bye!");
    }
}
// Объявляете переменные для входных данных и
// параметров программы: одну для хранения
// стоимости билета, другую для хранения количества
// рублей для одной бонусной милли

// Рассчитываете количество бонусных милль, используя
// значения заведённых переменных. Ответ сохраняете в
// новую переменную и выводите на экран
